{
  "terms": {
    "title": "Términos de Servicio",
    "lastUpdated": "Última actualización: Febrero 2026",
    "section1": {
      "title": "1. Aceptación de los Términos",
      "content": "Al acceder o usar RyderCupFriends (\"el Servicio\"), aceptas estar sujeto a estos Términos de Servicio. Si no estás de acuerdo con estos términos, por favor no uses el Servicio.\n\nEl Servicio es operado por RyderCupFriends (\"nosotros\" o \"nuestro\"). Nos reservamos el derecho de modificar estos términos en cualquier momento, y dichas modificaciones serán efectivas inmediatamente tras su publicación."
    },
    "section2": {
      "title": "2. Elegibilidad",
      "content": "Debes tener al menos 16 años para usar este Servicio. Al usar el Servicio, declaras y garantizas que cumples con este requisito de edad.\n\nSi eres menor de 18 años, debes contar con el consentimiento de tus padres o tutores para usar el Servicio."
    },
    "section3": {
      "title": "3. Cuentas de Usuario",
      "content": "Para acceder a ciertas funciones del Servicio, debes crear una cuenta. Eres responsable de mantener la confidencialidad de tus credenciales y de todas las actividades que ocurran bajo tu cuenta.\n\nTe comprometes a proporcionar información precisa, actual y completa durante el registro y a actualizar dicha información para mantenerla precisa y completa."
    },
    "section4": {
      "title": "4. Conducta del Usuario",
      "content": "Aceptas no usar el Servicio para:\n\n- Violar leyes o regulaciones aplicables\n- Hacerse pasar por otra persona o entidad\n- Acosar, abusar o dañar a otros usuarios\n- Subir contenido malicioso o intentar comprometer el Servicio\n- Usar sistemas automatizados para acceder al Servicio sin permiso\n- Interferir con el funcionamiento adecuado del Servicio"
    },
    "section5": {
      "title": "5. Reglas de Competiciones de Golf",
      "content": "RyderCupFriends proporciona herramientas para organizar competiciones de golf amateur. Todas las competiciones son informales y con fines recreativos únicamente.\n\nNo somos responsables de la precisión de los cálculos de handicap, puntuación o cualquier disputa derivada de los resultados de las competiciones. Los organizadores son responsables de garantizar el juego limpio entre los participantes."
    },
    "section6": {
      "title": "6. Propiedad Intelectual",
      "content": "El Servicio, incluyendo su diseño, funciones y contenido, es propiedad de RyderCupFriends y está protegido por leyes de propiedad intelectual. No puedes copiar, modificar, distribuir ni crear obras derivadas basadas en el Servicio sin nuestro permiso expreso por escrito.\n\nEl contenido que crees a través del Servicio (datos de competiciones, puntuaciones, etc.) sigue siendo tuyo, pero nos otorgas una licencia para usarlo para proporcionar y mejorar el Servicio."
    },
    "section7": {
      "title": "7. Limitación de Responsabilidad",
      "content": "El Servicio se proporciona \"tal cual\" y \"según disponibilidad\" sin garantías de ningún tipo. No garantizamos que el Servicio será ininterrumpido, libre de errores o seguro.\n\nEn la máxima medida permitida por la ley, RyderCupFriends no será responsable de ningún daño indirecto, incidental, especial o consecuente derivado de tu uso del Servicio."
    },
    "section8": {
      "title": "8. Terminación",
      "content": "Podemos suspender o terminar tu acceso al Servicio en cualquier momento, con o sin causa, y con o sin previo aviso. Tras la terminación, tu derecho a usar el Servicio cesará inmediatamente.\n\nPuedes eliminar tu cuenta en cualquier momento a través de la configuración del perfil. Tras la eliminación, tus datos personales serán eliminados de acuerdo con nuestra Política de Privacidad."
    },
    "section9": {
      "title": "9. Contacto",
      "content": "Si tienes preguntas sobre estos Términos de Servicio, contáctanos en support@rydercupfriends.com o a través de nuestra página de Contacto."
    }
  },
  "privacy": {
    "title": "Política de Privacidad",
    "lastUpdated": "Última actualización: Febrero 2026",
    "section1": {
      "title": "1. Información que Recopilamos",
      "content": "Recopilamos información que proporcionas directamente al crear una cuenta y usar el Servicio:\n\n- Información de cuenta: nombre, correo electrónico, país, género (opcional)\n- Perfil de golf: índice de handicap, preferencias de tee\n- Datos de competición: puntuaciones, resultados de partidos, asignaciones de equipo\n- Información del dispositivo: tipo de navegador, huella digital del dispositivo (por seguridad)"
    },
    "section2": {
      "title": "2. Cómo Usamos tu Información",
      "content": "Usamos la información recopilada para:\n\n- Proporcionar y mantener el Servicio\n- Gestionar tu cuenta y competiciones\n- Calcular handicaps y generar emparejamientos\n- Enviar notificaciones importantes sobre tus competiciones\n- Mejorar el Servicio y desarrollar nuevas funciones\n- Garantizar la seguridad y prevenir abusos"
    },
    "section3": {
      "title": "3. Cookies y Almacenamiento Local",
      "content": "Usamos los siguientes mecanismos de almacenamiento:\n\n- Cookies httpOnly: Tokens de autenticación (acceso y refresco) almacenados de forma segura y no accesibles vía JavaScript\n- localStorage: Preferencia de idioma (i18next), configuración de interfaz\n- Cookies de sesión: Tokens de protección CSRF\n\nNo usamos cookies de publicidad de terceros ni cookies de seguimiento."
    },
    "section4": {
      "title": "4. Servicios de Terceros",
      "content": "Usamos los siguientes servicios de terceros:\n\n- Sentry: Seguimiento de errores y monitoreo de rendimiento. Recopila datos de errores anonimizados y repeticiones de sesión para ayudarnos a corregir fallos.\n- Cloudflare: CDN y seguridad. Procesa solicitudes para proteger contra tráfico malicioso.\n- Render: Plataforma de alojamiento de la aplicación.\n\nEstos servicios tienen sus propias políticas de privacidad que rigen el uso de datos."
    },
    "section5": {
      "title": "5. Retención de Datos",
      "content": "Retenemos tus datos mientras tu cuenta esté activa. Si eliminas tu cuenta, eliminaremos tus datos personales en un plazo de 30 días, excepto cuando la retención sea requerida por ley.\n\nLos resultados de competiciones pueden conservarse de forma anonimizada con fines estadísticos."
    },
    "section6": {
      "title": "6. Tus Derechos",
      "content": "Tienes derecho a:\n\n- Acceder a tus datos personales a través de tu perfil\n- Actualizar o corregir tu información\n- Eliminar tu cuenta y datos asociados\n- Exportar tus datos de competiciones\n- Objetar ciertos procesamientos de tus datos\n\nPara ejercer estos derechos, contáctanos en support@rydercupfriends.com."
    },
    "section7": {
      "title": "7. Privacidad de Menores",
      "content": "El Servicio no está dirigido a menores de 16 años. No recopilamos intencionalmente información personal de menores de 16 años. Si crees que hemos recopilado inadvertidamente dicha información, contáctanos inmediatamente."
    },
    "section8": {
      "title": "8. Cambios en esta Política",
      "content": "Podemos actualizar esta Política de Privacidad periódicamente. Te notificaremos de cambios significativos publicando la política actualizada en esta página y actualizando la fecha de \"Última actualización\".\n\nTu uso continuado del Servicio después de la publicación de cambios constituye la aceptación de la política actualizada."
    },
    "section9": {
      "title": "9. Contacto",
      "content": "Si tienes preguntas o inquietudes sobre esta Política de Privacidad, contáctanos en support@rydercupfriends.com o a través de nuestra página de Contacto."
    }
  },
  "cookies": {
    "title": "Política de Cookies",
    "lastUpdated": "Última actualización: Febrero 2026",
    "section1": {
      "title": "1. Qué son las Cookies",
      "content": "Las cookies son pequeños archivos de texto almacenados en tu dispositivo cuando visitas un sitio web. Se usan ampliamente para que los sitios web funcionen de manera más eficiente y para proporcionar información a los propietarios del sitio.\n\nTambién usamos tecnologías similares como localStorage para almacenar preferencias."
    },
    "section2": {
      "title": "2. Cookies que Usamos",
      "content": "Cookies esenciales (necesarias para el funcionamiento del Servicio):\n\n- Cookies de autenticación (httpOnly): Tokens seguros de acceso y refresco que mantienen tu sesión iniciada. No son accesibles vía JavaScript, protegiéndote contra ataques XSS.\n- Cookie de token CSRF: Protege contra ataques de falsificación de solicitudes entre sitios.\n\nAlmacenamiento funcional (localStorage):\n\n- Preferencia de idioma: Recuerda tu idioma seleccionado (Inglés/Español).\n- Preferencias de interfaz: Tema y configuración de visualización.\n- Flags de sesión: Recuperación de errores de carga diferida."
    },
    "section3": {
      "title": "3. Gestión de Cookies",
      "content": "Puedes controlar las cookies a través de la configuración de tu navegador. Ten en cuenta que deshabilitar las cookies esenciales impedirá que inicies sesión y uses las funciones autenticadas del Servicio.\n\nPara borrar las cookies de autenticación, usa el botón \"Cerrar Sesión\" en la aplicación, que invalidará correctamente tu sesión."
    },
    "section4": {
      "title": "4. Cookies de Terceros",
      "content": "No usamos cookies de publicidad o seguimiento de terceros.\n\nNuestros servicios de terceros (Sentry para seguimiento de errores, Cloudflare para seguridad) pueden establecer sus propias cookies con fines funcionales. Estas se rigen por sus respectivas políticas de privacidad."
    },
    "section5": {
      "title": "5. Contacto",
      "content": "Si tienes preguntas sobre nuestro uso de cookies, contáctanos en support@rydercupfriends.com o a través de nuestra página de Contacto."
    }
  }
}
